// Lab_03_2.cpp
// < Сенишин Михайло >
// Лабораторна робота № 3.2
// Розгалуження, задане формулою: функція з параметрами.
// Варіант 10

#include <iostream>
using namespace std;

int main()
{
	double x, a, b, c, F; // вхідний аргумент, параметри, результат
	
	cout << "a = "; cin >> a;
	cout << "b = "; cin >> b; // считування параметрів з клавіатури
	cout << "c = "; cin >> c;
	
	cout << "x = "; cin >> x; // считування аргумента 
	
							  
	// спосіб 1: розгалуження в скороченій формі
	if (x < 3 && b != 0)
		F = a*pow(x,2) - b*x + c;
	
	if (x > 3 && b == 0)
		F = (x - a) / (x - c);
	
	if (!(x < 3 && b != 0) && !(x > 3 && b == 0))
		F = x / c;
	
	cout << endl;
	cout << "1) F = " << F << endl;
	
	// спосіб 2: розгалуження в повній формі
	
	if (x < 3 && b != 0)
		F = a * pow(x, 2) - b * x + c;
	else
		if (x > 3 && b == 0)
			F = (x - a) / (x - c);
		else
			F = x / c;

	cout << "2) F = " << F << endl;
	cin.get();
	
	return 0;
}
